{
  "api_contract": {
    "ruta": "/api/tasks",
    "descripcion": "API RESTful para la gestión completa de tareas en el tablero Kanban.",
    "esquema_de_datos_tarea": {
      "id": "integer",
      "content": "string",
      "state": "string (Valores permitidos: 'Por Hacer', 'En Progreso', 'Hecho')"
    },
    "endpoints": [
      {
        "metodo": "GET",
        "ruta": "/api/tasks",
        "descripcion": "Obtiene la lista completa de todas las tareas almacenadas."
      },
      {
        "metodo": "POST",
        "ruta": "/api/tasks",
        "descripcion": "Crea una nueva tarea. Requiere 'content' en el cuerpo. El estado por defecto es 'Por Hacer'."
      },
      {
        "metodo": "PUT",
        "ruta": "/api/tasks/<id>",
        "descripcion": "Actualiza el contenido y/o el estado de una tarea existente identificada por su ID."
      },
      {
        "metodo": "DELETE",
        "ruta": "/api/tasks/<id>",
        "descripcion": "Elimina permanentemente una tarea identificada por su ID."
      }
    ]
  },
  "contrato_qa_e2e": {
    "columna_por_hacer": "col-todo",
    "columna_en_progreso": "col-inprogress",
    "columna_hecho": "col-done",
    "input_nueva_tarea": "input-new-task",
    "boton_agregar_tarea": "btn-add-task",
    "tarjeta_tarea": "task-card",
    "texto_tarjeta": "task-text"
  },
  "plan": [
    {
      "etapa": "backend",
      "tareas": [
        "Inicializar el proyecto Flask creando la estructura de directorios básica y el archivo 'requirements.txt' con las dependencias necesarias (Flask).",
        "Crear el archivo 'pytest.ini' en la raíz del proyecto para configurar el path de ejecución de las pruebas.",
        "Crear el paquete 'backend/' e implementar el archivo '__init__.py' con la función 'create_app' como factory pattern.",
        "Configurar la aplicación Flask en '__init__.py' para servir archivos estáticos desde el directorio '../frontend'.",
        "Implementar un módulo de utilidades dentro de 'backend/' para manejar la lectura y escritura del archivo 'tasks.json' asegurando la persistencia de datos.",
        "Crear el archivo 'backend/routes.py' y definir un Blueprint Flask para la ruta '/api/tasks'.",
        "Implementar el endpoint GET en 'routes.py' para leer y devolver todas las tareas desde 'tasks.json'.",
        "Implementar el endpoint POST en 'routes.py' para recibir datos, generar un ID único, asignar estado 'Por Hacer' y guardar la nueva tarea.",
        "Implementar el endpoint PUT en 'routes.py' para actualizar el contenido o el estado de una tarea existente según su ID.",
        "Implementar el endpoint DELETE en 'routes.py' para eliminar una tarea del archivo 'tasks.json' basándose en su ID.",
        "Crear el archivo 'app.py' en la raíz que importe 'create_app' y ejecute el servidor de desarrollo.",
        "Crear el directorio 'tests/' y el archivo 'test_backend.py' con pruebas unitarias usando pytest para validar cada endpoint de la API."
      ]
    },
    {
      "etapa": "frontend",
      "tareas": [
        "Crear el archivo 'frontend/index.html' con la estructura HTML5 que incluya tres contenedores principales para las columnas: 'Por Hacer', 'En Progreso' y 'Hecho'.",
        "Añadir estilos CSS en 'index.html' utilizando Flexbox o CSS Grid para alinear las columnas horizontalmente y dar formato de tarjeta a las tareas.",
        "Implementar un formulario en la columna 'Por Hacer' con un campo de texto y un botón para la creación de nuevas tareas.",
        "Escribir el código JavaScript para cargar las tareas al inicio realizando una petición asíncrona (fetch) al endpoint GET '/api/tasks'.",
        "Implementar la función en JavaScript que renderice dinámicamente las tarjetas en la columna correspondiente según su estado.",
        "Añadir la lógica JavaScript para manejar el envío del formulario, realizando una petición POST '/api/tasks' y recargando la vista.",
        "Implementar la funcionalidad de Drag and Drop usando la API nativa de HTML5: añadir atributos 'draggable' a las tarjetas y manejar eventos 'dragstart', 'dragover' y 'drop'.",
        "Implementar la lógica en el evento 'drop' para identificar la columna de destino y enviar una petición PUT '/api/tasks/<id>' con el nuevo estado.",
        "Implementar la funcionalidad de edición: al hacer clic en el texto de una tarjeta, permitir la edición y enviar una petición PUT '/api/tasks/<id>' al confirmar."
      ]
    },
    {
      "etapa": "e2e",
      "tareas": [
        "Instalar y configurar Cypress en el proyecto, creando el archivo de configuración 'cypress.config.js'.",
        "Crear el archivo de prueba 'cypress/e2e/kanban.cy.js'.",
        "Escribir una prueba E2E que visite la aplicación, verifique que las columnas se renderizan correctamente y añada una tarea nueva.",
        "Escribir una prueba E2E que simule el arrastre de una tarjeta desde la columna 'Por Hacer' hasta 'En Progreso' y valide el cambio mediante los selectores 'data-testid'.",
        "Escribir una prueba E2E que verifique la edición del contenido de una tarjeta existente y su persistencia."
      ]
    }
  ]
}